sdaiGetADBType(Sdai_ADBId*)
\details
Retrieves the type of the value stored in the attributed data block (ADB).
\param block [in] An identifier of the  ADB instance.
\returns The type of data that the ADB instance contains.